Repository: inveniosoftware/invenio-drafts-resources
Catalog: invenio_drafts_resources/translations/*/LC_MESSAGES/messages.po
Languages: fi, sv

source: Redirecting...
fi: Uudelleenohjataan...
sv: Omdirigerar...

source: Best match
fi: Paras osuma
sv: Bästa matchningen

source: Newest
fi: Uusin
sv: Nyast

source: Oldest
fi: Vanhin
sv: Äldst

source: Version
fi: Versio

source: Recently updated
fi: Vasta päivitetty
sv: Nyast uppdatering

source: Least recently updated
fi: Vanhimmin päivitetty
sv: Äldst uppdatering

source: Records should be updated via their draft.
fi: Tietueet tulee päivittää luonnosversion kautta.
sv: Poster bör uppdateras via deras utkast.

source: Failed to fetch the record versions.
fi: Tietueen versioiden hakeminen epäonnistui.
sv: Det gick inte att hämta postens versioner.

source: Files support is not enabled.
fi: Tuki tiedostoille ei ole käytössä.
sv: Filstöd är inte aktiverat.

source: You don't have permissions to manage files options.
fi: Sinulla ei ole oikeuksia hallita tiedostoasetuksia.
sv: Du har inte behörighet att hantera filalternativ.

source: Missing uploaded files. To disable files for this record please mark it as metadata-only.
fi: Ladatut tiedostot puuttuvat. Kytke tiedostojen näyttö pois tältä tietueelta, merkitse se vain metatietoja sisältäväksi.
sv: Uppladdade filer saknas. För att inaktivera filer för denna post, markera den som endast metadata.

source: Missing uploaded files.
fi: Ladatut tiedostot puuttuvat.
sv: Uppladdade filer saknas.

source: One or more files have not completed their transfer, please wait.
fi: Yhden tai useamman tiedoston siirto ei ole vielä valmis, odota hetki.
sv: Överföringen av en eller flera filer har inte slutförts, vänligen vänta.

source: Files support must be enabled.
fi: Tiedostotuki on otettava käyttöön.
sv: Filstöd måste vara aktiverat.

source: Please remove all files first.
fi: Poista ensin kaikki tiedostot.
sv: Ta bort alla filer först.

source: The record has no files.
fi: Tietueella ei ole tiedostoja.
sv: Posten har inga filer.
